Revit 2024 API
RebarUpdateCurvesData.AlignedFreeFormSetOrientationOptions Property
 Orientation options for an Aligned Free Form Rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions { get; }
Visual Basic
Public ReadOnly Property AlignedFreeFormSetOrientationOptions As AlignedFreeFormSetOrientationOptions
	Get
Visual C++
public:
property AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions {
	AlignedFreeFormSetOrientationOptions get ();
}
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace